CREATE 
    ALGORITHM = UNDEFINED 
    DEFINER = `root`@`localhost` 
    SQL SECURITY DEFINER
VIEW `l6_2` AS
    SELECT 
        `партія`.`Код_товара` AS `Код_товара`,
        `партія`.`Код_партіі` AS `Код_партіі`,
        `партія`.`Код_накладної` AS `Код_накладної`,
        `партія`.`Кількість` AS `Кількість`,
        `партія`.`Ціна` AS `Ціна`,
        `товари`.`Код_торгової_марки` AS `Код_торгової_марки`,
        `товари`.`Код_під_типу` AS `Код_під_типу`,
        `товари`.`Назва_товару` AS `Назва_товару`,
        `товари`.`Ціна_закупки` AS `Ціна_закупки`,
        `товари`.`Код_матеріал` AS `Код_матеріал`
    FROM
        (`партія`
        LEFT JOIN `товари` ON ((`товари`.`Код_товара` = `партія`.`Код_товара`)))