CREATE 
    ALGORITHM = UNDEFINED 
    DEFINER = `root`@`localhost` 
    SQL SECURITY DEFINER
VIEW `l6_4_1` AS
    SELECT 
        `t1`.`Код_накладної` AS `Код_накладної`,
        `t1`.`Дата` AS `Дата`,
        `t2`.`Прізвище` AS `Прізвище`,
        `t3`.`Статус` AS `Статус`,
        `t4`.`Назва_операції` AS `Назва_операції`
    FROM
        (((`накладна` `t1`
        JOIN `співробітник` `t2` ON ((`t1`.`Код_співробітника` = `t2`.`Код_співробітника`)))
        JOIN `статус` `t3` ON ((`t1`.`Код_статусу_операції` = `t3`.`Код_статусу_операції`)))
        JOIN `вид_операції` `t4` ON ((`t1`.`Код_виду_операції` = `t4`.`Код_виду_операції`)))